[
  {
    "chunk_idx": 0,
    "text": "Hồi ấy đang giữa mùa đông, hoa tuyết như những lông chim bay khắp bầu trời, có một bà hoàng hậu ngồi khâu bên cửa sổ.",
    "num_words": 26,
    "start_char": 0
  },
  {
    "chunk_idx": 1,
    "text": "Hoàng hậu ngồi khâu nhưng lại mải ngắm tuyết rơi nên bị kim đâm vào ngón tay, và ba giọt máu đỏ rơi xuống tuyết trắng phau.",
    "num_words": 27,
    "start_char": 155
  },
  {
    "chunk_idx": 2,
    "text": "Nhìn màu đỏ tươi nổi bật trên tuyết, hoàng hậu tự nhủ:",
    "num_words": 12,
    "start_char": 279
  },
  {
    "chunk_idx": 3,
    "text": "- Giá mình có một đứa con da trắng như tuyết, môi đỏ hồng hào như màu máu đỏ tươi, tóc đen nhánh như gỗ mun khung cửa sổ này thì hay quá nhỉ.",
    "num_words": 34,
    "start_char": 334
  },
  {
    "chunk_idx": 4,
    "text": "Ít lâu sau bà sinh được một cô con gái da trắng như tuyết, môi đỏ như son và tóc đen nhánh như gỗ mun, vì thế bà đặt tên con gái là Bạch Tuyết.",
    "num_words": 35,
    "start_char": 476
  },
  {
    "chunk_idx": 5,
    "text": "Mụ này có một chiếc gương thần, mỗi khi đứng ngắm mình trước gương, thường hỏi: - Gương kia ngự ở trên tường, Nước này ai đẹp được dường như ta.",
    "num_words": 31,
    "start_char": -1
  },
  {
    "chunk_idx": 6,
    "text": "Từ đó trở đi, mỗi khi thoáng nhìn thấy Bạch Tuyết là mụ đã khó chịu, bực tức, rồi đâm ra căm ghét cô bé.",
    "num_words": 25,
    "start_char": 1518
  },
  {
    "chunk_idx": 7,
    "text": "Mụ cho gọi một người thợ săn đến và bảo: - Ngươi hãy mang con bé này vào trong rừng sâu, ta không muốn nhìn mặt nó nữa.",
    "num_words": 28,
    "start_char": -1
  },
  {
    "chunk_idx": 8,
    "text": "Nhưng khi bác rút dao ra định đâm thì cô bé khóc và nói:",
    "num_words": 14,
    "start_char": 1973
  },
  {
    "chunk_idx": 9,
    "text": "- Trời ơi, bác thợ săn yêu quý, bác hãy để cháu sống, cháu sẽ chạy trốn trong rừng hoang vu này, cháu xin thề là sẽ không bao giờ trở lại cung nữa.",
    "num_words": 34,
    "start_char": 2030
  },
  {
    "chunk_idx": 10,
    "text": "Bác nghĩ: \"Rồi có khi thú dữ lại ăn thịt cô bé mất thôi!.\" Nhưng dù sao bác cảm thấy trút được gánh nặng trong lòng vì chẳng phải giết người.",
    "num_words": 31,
    "start_char": 2280
  },
  {
    "chunk_idx": 11,
    "text": "Đúng lúc đó có một con lợn rừng con nhảy tới, bác đâm chết lấy gan phổi mang về nộp hoàng hậu làm bằng chứng.",
    "num_words": 25,
    "start_char": 2422
  },
  {
    "chunk_idx": 12,
    "text": "Còn lại cô bé bất hạnh lủi thủi một mình trong rừng rộng mênh mông, cô sợ hãi, ngơ ngác nhìn lá cây ngọn cỏ chẳng biết làm gì.",
    "num_words": 29,
    "start_char": 2646
  },
  {
    "chunk_idx": 13,
    "text": "Cô bé cứ thế chạy mãi, chạy mãi, tới lúc trời sẩm tối cô mới nhìn thấy một căn nhà nhỏ, liền vào đó nghỉ chân.",
    "num_words": 26,
    "start_char": 2897
  },
  {
    "chunk_idx": 14,
    "text": "Giữa nhà có một cái bàn trải khăn trắng tinh, trên bàn bày bảy cái đĩa nhỏ xinh xinh, mỗi đĩa có một thìa con, một dao con, một nĩa on và cạnh đó là một ly cũng nho nhỏ",
    "num_words": 40,
    "start_char": 3105
  },
  {
    "chunk_idx": 15,
    "text": "Đang đói và khát, Bạch Tuyết ăn ở mỗi đĩa một ít rau, ít bánh và uống ở mỗi ly một hớp rượu vang, vì cô không muốn để một ai phải mất phần.",
    "num_words": 34,
    "start_char": 3392
  },
  {
    "chunk_idx": 16,
    "text": "Suốt ngày chạy trốn trong rừng, giờ cô đã thấm mệt muốn đặt mình xuống giường nằm ngủ nhưng giường lại không vừa, cái thì dài quá, cái khác lại ngắn quá.",
    "num_words": 32,
    "start_char": 3532
  },
  {
    "chunk_idx": 17,
    "text": "Khi trời tối mịt, những chủ nhân của căn nhà nhỏ mới về: đó là bảy chú lùn thường ngày đào bới quặng sắt ở trong núi.",
    "num_words": 27,
    "start_char": 3752
  },
  {
    "chunk_idx": 18,
    "text": "Họ thắp bảy ngọn đèn xinh xinh, và khi đèn tỏa sáng khắp căn nhà, họ cảm thấy hình như có ai đã vào nhà, vì mọi vật không còn giữ nguyên như khi họ rời căn nhà đi làm",
    "num_words": 40,
    "start_char": 3870
  },
  {
    "chunk_idx": 19,
    "text": "Ai nấy đều ngạc nhiên, họ cầm bảy ngọn đèn soi Bạch Tuyết và reo lên: - Cha, cô bé sao mà xinh đẹp thế!",
    "num_words": 25,
    "start_char": -1
  },
  {
    "chunk_idx": 20,
    "text": "Thế là cô kể cho họ nghe chuyện dì ghẻ định ám hại cô, nhưng người thợ săn đã để cho cô sống và cô đã chạy trốn suốt cả ngày trong rừng tới khi sẩm tối thì thấy căn",
    "num_words": 40,
    "start_char": 5141
  },
  {
    "chunk_idx": 21,
    "text": "- Nếu cô đồng ý trông nom nhà cửa, nấu ăn, rũ giường, giặt quần áo, khâu vá, thêu thùa, quét tước, dọn dẹp nhà cửa cho sạch sẽ ngăn nắp thì cô có thể ở lại với chúng tôi,",
    "num_words": 40,
    "start_char": 5338
  },
  {
    "chunk_idx": 22,
    "text": "Cô đảm đương mọi việc trong nhà, sáng sáng các chú lùn vào mỏ tìm sắt và vàng cho mãi tới chiều tối mới về, thì thức ăn của họ đã bày sẵn trên bàn.",
    "num_words": 35,
    "start_char": 5636
  },
  {
    "chunk_idx": 23,
    "text": "Hoàng hậu đinh ninh tưởng mình đã ăn gan phổi Bạch Tuyết nên chắc rằng chỉ còn có mình là người đẹp nhất trần gian.",
    "num_words": 25,
    "start_char": 5966
  },
  {
    "chunk_idx": 24,
    "text": "Gương trả lời: - Thưa hoàng hậu, Ở đây bà đẹp tuyệt trần, Nhưng còn Bạch Tuyết muôn phần đẹp hơn, Nàng ta ở khuất núi non, Nơi nhà của bảy chú lùn sống chung.",
    "num_words": 35,
    "start_char": -1
  },
  {
    "chunk_idx": 25,
    "text": "Mụ ngồi nghĩ mưu giết Bạch Tuyết cho bằng được, chừng nào mụ chưa được gương gọi là người đẹp nhất thì ghen tức còn làm cho mụ mất ăn mất ngủ.",
    "num_words": 32,
    "start_char": 6476
  },
  {
    "chunk_idx": 26,
    "text": "Sau mụ nghĩ ra một kế, mụ bôi mặt, mặc quần áo trá hình thành một bà lão bán hàng, ai có gặp cũng khó lòng nhận ra được.",
    "num_words": 29,
    "start_char": 6619
  },
  {
    "chunk_idx": 27,
    "text": "Một lát thì trời tối, bảy chú lùn về nhà, thấy Bạch Tuyết yêu quý của họ nằm sóng soài trên mặt đất như chết, người không hề nhúc nhích cử động, họ rất lo lắng.",
    "num_words": 36,
    "start_char": 7546
  },
  {
    "chunk_idx": 28,
    "text": "Họ nhấc cô lên thì thấy chiếc dây lưng thắt chặt cứng, lấy dao cắt đứt dây, Bạch Tuyết lại khe khẽ thở và dần dần tỉnh dậy.",
    "num_words": 28,
    "start_char": 7707
  },
  {
    "chunk_idx": 29,
    "text": "Sau khi nghe Bạch Tuyết kể chuyện vừa xảy ra, bảy chú lùn bảo cô:",
    "num_words": 15,
    "start_char": 7831
  },
  {
    "chunk_idx": 30,
    "text": "- Mụ già bán hàng ấy chắc chẳng ai khác ngoài mụ hoàng hậu độc ác, cô phải giữ mình cẩn thận nhé, khi chúng tôi đi vắng thì đừng cho ai vào nhà cả.",
    "num_words": 35,
    "start_char": 7897
  },
  {
    "chunk_idx": 31,
    "text": "Về tới nhà, mụ hoàng hậu độc ác đến trước gương soi và hỏi: - Gương kia ngự ở trên tường, Nước này ai đẹp được dường như ta.",
    "num_words": 29,
    "start_char": -1
  },
  {
    "chunk_idx": 32,
    "text": "Cũng như mọi lần, gương trả lời: - Thưa hoàng hậu, Ở đây bà đẹp tuyệt trần, Nhưng còn Bạch Tuyết muôn phần đẹp hơn, Nàng ta ở khuất núi non, Nơi nhà của bảy chú lùn sống chung.",
    "num_words": 39,
    "start_char": -1
  },
  {
    "chunk_idx": 33,
    "text": "Khi đôi bên thỏa thuận giá cả xong, mụ già nói: - Giờ để bà chải cho con nhé, bà chải cho thật đẹp nhé!",
    "num_words": 25,
    "start_char": -1
  },
  {
    "chunk_idx": 34,
    "text": "Thấy Bạch Tuyết nằm như chết ở dưới đất, họ nghi ngay mụ dì ghẻ, họ lùng sục và tìm thấy chiếc lược tẩm thuốc độc cài trên đầu, vừa mới lấy lược ra thì Bạch Tuyết tỉnh dậy kể",
    "num_words": 40,
    "start_char": 9412
  },
  {
    "chunk_idx": 35,
    "text": "Bước chân về tới nhà, hoàng hậu lại soi gương và hỏi: - Gương kia ngự ở trên tường, Nước này ai đẹp được dường như ta.",
    "num_words": 27,
    "start_char": -1
  },
  {
    "chunk_idx": 36,
    "text": "Cũng như mọi lần, gương trả lời: - Thưa hoàng hậu, Ở đây bà đẹp tuyệt trần, Nhưng còn Bạch Tuyết muôn phần đẹp hơn, Nàng ta ở khuất núi non, Nơi nhà của bảy chú lùn sống chung.",
    "num_words": 39,
    "start_char": -1
  },
  {
    "chunk_idx": 37,
    "text": "Nghe gương như vậy toàn thân mụ run lên vì tức giận, mụ thét lên: - Bạch Tuyết, mày phải chết, dù tao có mất mạng cũng cam lòng.",
    "num_words": 29,
    "start_char": -1
  },
  {
    "chunk_idx": 38,
    "text": "Sau đó mụ vào một căn phòng hẻo lánh trong lâu đài nơi không hề có ai bước chân tới, và mụ tẩm thuốc độc vào táo, quả táo chín đỏ trông rất ngon, ngon đến nỗi ai nhìn thấy",
    "num_words": 40,
    "start_char": 10122
  },
  {
    "chunk_idx": 39,
    "text": "Mụ gõ cửa, Bạch Tuyết thò đầu qua cửa sổ nói: - Cháu không được phép cho ai vào nhà, vì bảy chú lùn đã cấm rồi.",
    "num_words": 27,
    "start_char": -1
  },
  {
    "chunk_idx": 40,
    "text": "Quả táo được tẩm thuốc rất khéo léo: chỉ nửa táo chín đỏ ngấm thuốc độc, Bạch Tuyết mắt hau háu nhìn quả táo chín ngon, thấy bà nông dân ăn mà không sao cả nên không dằn lòng được",
    "num_words": 40,
    "start_char": 10896
  },
  {
    "chunk_idx": 41,
    "text": "Hoàng hậu nhìn cô với con mắt gườm gườm, rồi cười khanh khách và nói: - Trắng như tuyết, đỏ như máu, đen như gỗ mun.",
    "num_words": 26,
    "start_char": -1
  },
  {
    "chunk_idx": 42,
    "text": "Theo thường lệ, đến tối bảy chú lùn mới về nhà, vừa bước vào cửa thì thấy ngay Bạch Tuyết nằm dưới đất, tim đã ngừng đập, không thấy hơi thở ra nữa, Bạch Tuyết đã chết.",
    "num_words": 37,
    "start_char": 11629
  },
  {
    "chunk_idx": 43,
    "text": "Bảy chú lùn nâng cô dậy, tìm xem có dấu vết chất độc nào không, rồi lấy nước và rượu lau mặt cho cô nhưng chẳng ăn thua gì; cô bé tội nghiệp ấy đã chết, chết thật rồi.",
    "num_words": 39,
    "start_char": 11798
  },
  {
    "chunk_idx": 44,
    "text": "Sau đó họ muốn đem đi chôn nhưng thấy sắc người cô vẫn tươi tỉnh như người sống, đôi má xinh đẹp vẫn ửng hồng.",
    "num_words": 25,
    "start_char": 12046
  },
  {
    "chunk_idx": 45,
    "text": "Bạch Tuyết nằm trong quan tài đã lâu lắm mà thi thể vẫn nguyên, nom như nàng đang nằm ngủ, vì nàng vẫn trắng như tuyết, đỏ hồng như máu, tóc vẫn đen như gỗ mun.",
    "num_words": 36,
    "start_char": 12527
  },
  {
    "chunk_idx": 46,
    "text": "Hồi đó, có một hoàng tử nước láng giềng đi lạc vào rừng và tới căn nhà của bảy chú lùn xin ngủ nhờ qua đêm.",
    "num_words": 26,
    "start_char": 12688
  },
  {
    "chunk_idx": 47,
    "text": "Hoàng tử nhìn thấy chiếc quan tài thủy tinh trên núi, Bạch Tuyết nằm trong chiếc quan tài có khắc dòng chữ vàng, đọc xong dòng chữ hoàng tử nói:",
    "num_words": 30,
    "start_char": 12796
  },
  {
    "chunk_idx": 48,
    "text": "Hoàng tử nói: - Thế thì tặng tôi vậy, vì tôi không thể sống nếu không được trông thấy Bạch Tuyết, tôi thương yêu và kính trọng nàng như người yêu nhất trần đời của tôi.",
    "num_words": 36,
    "start_char": -1
  },
  {
    "chunk_idx": 49,
    "text": "Thị vệ đi vấp phải rễ cây rừng làm nảy thi hài Bạch Tuyết lên, miếng táo tẩm thuốc độc nàng ăn phải bắn ra khỏi cổ họng.",
    "num_words": 28,
    "start_char": 13418
  },
  {
    "chunk_idx": 50,
    "text": "Ngay sau đó, nàng từ từ mở mắt ra, nâng nắp quan tài lên, ngồi nhỏm dậy và nói: - Trời ơi, tôi đang ở đâu đây?",
    "num_words": 27,
    "start_char": -1
  },
  {
    "chunk_idx": 51,
    "text": "Mừng rỡ, hoàng tử nói: - Ta quý nàng hơn tất cả mọi thứ trên đời này, nàng hãy cùng ta về cung điện của vua cha, nàng sẽ là vợ của ta.",
    "num_words": 33,
    "start_char": -1
  },
  {
    "chunk_idx": 52,
    "text": "Sau khi ăn mặc thật lộng lẫy, mụ lại đứng trước gương soi và hỏi: - Gương kia ngự ở trên tường, Nước này ai đẹp được dường như ta.",
    "num_words": 30,
    "start_char": -1
  },
  {
    "chunk_idx": 53,
    "text": "Mới đầu mụ toan không đi dự đám cưới, nhưng mụ đứng ngồi không yên, mụ sốt ruột và muốn xem mặt hoàng hậu trẻ.",
    "num_words": 25,
    "start_char": 14268
  },
  {
    "chunk_idx": 54,
    "text": "Nhưng giày sắt đã đặt trên lửa rồi, nhà vua trừng phạt buộc mụ phải xỏ chân vào đôi giày sắt nung đỏ và nhảy cho tới khi ngã lăn ra đất mà chết.",
    "num_words": 34,
    "start_char": 14497
  }
]